In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
data = pd.read_csv('Social_Network_Ads.csv')
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          1
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          1
4  15804002    Male   19            76000          0

In [8]:
data.shape

(10, 5)

# Creating Training set and Test set from the original data

### Step I : Seperate X and y

In [3]:
X = data.drop('Purchased', axis = 1)
y = data['Purchased']

In [4]:
X.head()

    User ID  Gender  Age  EstimatedSalary
0  15624510    Male   19            19000
1  15810944    Male   35            20000
2  15668575  Female   26            43000
3  15603246  Female   27            57000
4  15804002    Male   19            76000

In [5]:
y.head()

0    0
1    1
2    0
3    1
4    0
Name: Purchased, dtype: int64

In [6]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size = 0.20)

In [7]:
X_train

    User ID  Gender  Age  EstimatedSalary
6  15598044  Female   27            84000
1  15810944    Male   35            20000
5  15728773    Male   27            58000
3  15603246  Female   27            57000
9  15727311  Female   35            65000
7  15694829  Female   32           150000
0  15624510    Male   19            19000
4  15804002    Male   19            76000

In [9]:
X_test

    User ID  Gender  Age  EstimatedSalary
2  15668575  Female   26            43000
8  15600575    Male   25            33000

In [10]:
y_train

6    0
1    1
5    0
3    1
9    1
7    1
0    0
4    0
Name: Purchased, dtype: int64

In [11]:
y_test

2    0
8    0
Name: Purchased, dtype: int64

In [16]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size = 0.20, random_state = 0)

In [17]:
X_train

    User ID  Gender  Age  EstimatedSalary
4  15804002    Male   19            76000
9  15727311  Female   35            65000
1  15810944    Male   35            20000
6  15598044  Female   27            84000
7  15694829  Female   32           150000
3  15603246  Female   27            57000
0  15624510    Male   19            19000
5  15728773    Male   27            58000

In [18]:
X_test

    User ID  Gender  Age  EstimatedSalary
2  15668575  Female   26            43000
8  15600575    Male   25            33000

## Notes for Train test spilt

1. The entire data gets divided into 4 parts namely, X_train, X_test, y_train, y_test
2. The split size is usually selected as 80% - 20% split, 70% - 30% split, etc. The idea is the training set should be big and the testing set should be small
3. Random state is used to stablize the split
4. Train Test Split is also called as Hold One Out Cross Validation Technique